
//유재석; //자료가 아닌 상태(문자열이 아닌 코드)

//문자열 자료들을 표현하기 위해 " " 감싼
"유재석";
// 1. let 키워드: 변수 만들게씁니다. 선언 키워드
// 예] 키워드: 자주 사용되는 미리 정의된 문자
//let:키워드
//"let"=자료(문자열)

 let 이름1; //상자 만들기, 초기(처음)값
 console.log("이름1")
 consdle.log(이름)

 // 2. 초기화: 변수를 만들 때 값/자료 대입
 let 이름2= "유재석";
 console.log("유재석2");
 console.log(이름2)
 // 3. 변수 호출: 변수명 호출
 이름2; // 변수 명 호출시 변수값 변환
 console.log(이름2); // 변수명 호춫ㄹ시 변수값 반환 출력

 // 4. 변수값 저장
 이름1= "강호동";
 이름2="유재석2";

 //5. 상자에 읽기모드 = 상수
 const 이름3 = "신동엽";
 console.log(이름3);
 //이름3="신동엽2"